// candidates-data.js
// ใส่ข้อมูลผู้สมัครทุกคนไว้ที่นี่ไฟล์เดียว

window.CANDIDATES = [
  {
    id: "1",
    number: "1",
    role: "หัวหน้าพรรค",
    firstName: "ชื่อจริง",
    lastName: "นามสกุล",
    photo: "assets/candidates/1.webp",
    achievementsTitle: "ผลงานที่เคยทำมา",
    achievements: [
      "ตัวอย่างผลงาน 1",
      "ตัวอย่างผลงาน 2",
      "ตัวอย่างผลงาน 3"
    ],
    education: [
      "ม.1–ม.3 โรงเรียนสิรินธร",
      "ปัจจุบัน ม.4 โรงเรียนสิรินธร"
    ]
  },
  {
    id: "2",
    number: "2",
    role: "รองหัวหน้า",
    firstName: "ชื่อจริง",
    lastName: "นามสกุล",
    photo: "assets/candidates/2.webp",
    achievementsTitle: "ผลงานที่เคยทำมา",
    achievements: ["ตัวอย่างผลงาน 1", "ตัวอย่างผลงาน 2"],
    education: ["ประวัติการศึกษา 1", "ประวัติการศึกษา 2"]
  },
  {
    id: "3",
    number: "3",
    role: "ฝ่ายกิจกรรม",
    firstName: "ชื่อจริง",
    lastName: "นามสกุล",
    photo: "assets/candidates/3.webp",
    achievementsTitle: "ผลงานที่เคยทำมา",
    achievements: ["ตัวอย่างผลงาน 1"],
    education: ["ประวัติการศึกษา 1"]
  },
  {
    id: "4",
    number: "4",
    role: "ฝ่ายอะไรไม่รู้",
    firstName: "ณัฐพงษ์",
    lastName: "เรืองปัญญาวุณิ",
    photo: "assets/candidates/4.webp",
    achievementsTitle: "ผลงานที่เคยทำมา",
    achievements: ["ตัวอย่างผลงาน 1"],
    education: ["ประวัติการศึกษา 1"]
  },
  {
    id: "5",
    number: "5",
    role: "หัวหน้างานวางแผนสารสนเทศ",
    firstName: "ณัฐพงษ์",
    lastName: "พงษ์นุเคราะห์ศิริ",
    photo: "assets/candidates/5.webp",
    achievementsTitle: "ผลงานที่เคยทำมา",
    achievements: [
        "รางวัลระดับเหรีญทองแดง การแข่งการเขียนโปรแกรมด้วยภาษาคอมพิวเตอร์ งานศิลปหัตถกรรม สพม.สุรินทร์ 70",
        "เป็นผู้ผ่านการเข้าร่วม English Navigator Camp",
        "รางวัลระดับเหรียญทอง รองชนะเลิศอันดับที่ 1 การแข่งขันสร้างเกมสร้างสรรค์จากคอมพิวเตอร์ งานศิลปหัตถกรรม สพม.สุรินทร์ 71";
        "รางวัลชนะเลิศ การแข่งขันสร้าง Infographic โครงการ Computer Education KKU Open House 2023",
        "เป็นผู้ผ่านการเข้าร่วม English Channel Camp",
        "เป็นผู้ผ่านการเข้าร่วมศึกษา ERICAN Language Centre ณ ประเทศสิงคโปร",
        "เป็นผู้ผ่านการเข้าร่วมศึกษา The YPLS School of Learning ณ ประเทศสิงคโปร",
        "รางวัลรองชนะเลิศอันดับ 2 การประกวดออบแบบรั้วโรงเรียนสิรินธร",
        "รายการ Sirindhorn School Test 2024: เหรียญทองวิชาคณิตศาสตร์, เหรียญเงินวิชาภาษาอังกฤษ, เหรียญทองแดงวิชาวิทยาศาสตร์",
        "เป็นผู้ผ่านการเข้าค่ายจุดประกายเส้นทางนักวิทยาศาสตร์ ณ บ้านวิทยาศาสตร์สิรินธร มหาวิทยาลัยธรรมศาสตร์",
        "เป็นผู้ผ่านการเข้าค่ายวิทยาศาสตร์สิ่งแวดล้อม ณ คณะวิทยาศาสตร์ มหาวิทยาลัยบูรพา",
        "เป็นผู้ผ่านการเข้าค่าย Clickcamp ครั้งที่ 16 ณ มหาวิทยาลัยมหิดล",
    ],
    education: ["ประวัติการศึกษา 1"]
  }
];
